RT-Thread/rt-thread/bsp/nxp/imx/imxrt/libraries/MIMXRT1020/MIMXRT1021/drivers/fsl_enet.c
#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
static inline void ENET_PrepareTxDesc(volatile enet_tx_bd_struct_t *txDesc, enet_tx_config_struct_t *txConfig)
{
    uint16_t controlExtend1 = 0U;

    /* For enable the timestamp. */
    if (txConfig->intEnable)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_INTERRUPT_MASK;
    }
    if (txConfig->tsEnable)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_TIMESTAMP_MASK;
    }
    if (txConfig->autoProtocolChecksum)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_PROTOCHECKSUM_MASK;
    }
    if (txConfig->autoIPChecksum)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_IPCHECKSUM_MASK;
    }
#if defined(FSL_FEATURE_ENET_HAS_AVB) && FSL_FEATURE_ENET_HAS_AVB
    if (txConfig->tltEnable)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_USETXLAUNCHTIME_MASK;
        txDesc->txLaunchTimeLow |= txConfig->tltLow;
        txDesc->txLaunchTimeHigh |= txConfig->tltHigh;
    }
    controlExtend1 |= (uint16_t)ENET_BD_FTYPE(txConfig->AVBFrameType);
#endif /* FSL_FEATURE_ENET_HAS_AVB */

    txDesc->controlExtend1 = controlExtend1;
}
#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */

/*!
 * brief Sends one frame in specified BD ring with zero copy.
 *
 * This function supports scattered buffer transmit, user needs to provide the buffer array.
 * note Tx reclaim should be enabled to ensure the Tx buffer ownership can be given back to
 * application after Tx is over.
 *
 * param base   ENET peripheral base address.
 * param handle The ENET handler pointer. This is the same handler pointer used in the ENET_Init.
 * param txFrame The Tx frame structure.
 * param ringId The ring index or ring number.
 * retval kStatus_Success  Succeed to send one frame.
 * retval kStatus_ENET_TxFrameBusy  The BD is not ready for Tx or the reclaim operation still not finishs.
 * retval kStatus_ENET_TxFrameOverLen  The Tx frame length is over max ethernet frame length.
 */
status_t ENET_StartTxFrame(ENET_Type *base, enet_handle_t *handle, enet_tx_frame_struct_t *txFrame, uint8_t ringId)
{
    assert(handle != NULL);
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_QUEUE);
    assert(txFrame->txBuffArray != NULL);
    assert(txFrame->txBuffNum != 0U);
    assert(handle->txReclaimEnable[ringId]);

    volatile enet_tx_bd_struct_t *curBuffDescrip;
    enet_tx_bd_ring_t *txBdRing       = &handle->txBdRing[ringId];
    enet_tx_dirty_ring_t *txDirtyRing = &handle->txDirtyRing[ringId];
    status_t result                   = kStatus_Success;
    enet_buffer_struct_t *txBuff      = txFrame->txBuffArray;
    uint32_t txBuffNum                = txFrame->txBuffNum;
    enet_frame_info_t *txDirty        = NULL;
    uint32_t frameLen                 = 0;
    uint32_t idleDescNum              = 0;
    uint16_t index                    = 0;
    uint32_t configVal;
    uint32_t primask;
    void *buffer;

    /* Calculate frame length and Tx data buffer number. */
    do
    {
        frameLen += txBuff->length;
        txBuff++;
    } while (--txBuffNum != 0U);
    txBuffNum = txFrame->txBuffNum;

    /* Check whether the available BD number is enough for Tx data buffer. */
    curBuffDescrip = txBdRing->txBdBase + txBdRing->txGenIdx;
    index          = txBdRing->txGenIdx;
    do
    {
        if (0U != (curBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_READY_MASK))
        {
            break;
        }

        /* Idle BD number is enough */
        if (++idleDescNum >= txBuffNum)
        {
            break;
        }
        index          = ENET_IncreaseIndex(index, txBdRing->txRingLen);
        curBuffDescrip = txBdRing->txBdBase + index;
    } while (index != txBdRing->txGenIdx);

    /* Check the frame length. */
    if (frameLen > ENET_FRAME_TX_LEN_LIMITATION(base))
    {
        result = kStatus_ENET_TxFrameOverLen;
    }
    /* Return busy if idle BD is not enough. */
    else if (txBuffNum > idleDescNum)
    {
        result = kStatus_ENET_TxFrameBusy;
    }
    /* Check txDirtyRing if need frameinfo in tx interrupt callback. */
    else if (!ENET_TxDirtyRingAvailable(txDirtyRing))
    {
        result = kStatus_ENET_TxFrameBusy;
    }
    else
    {
        txBuff = txFrame->txBuffArray;
        do
        {
            assert(txBuff->buffer != NULL);

#if defined(FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL) && FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL
            if (handle->txMaintainEnable[ringId])
            {
                DCACHE_CleanByRange((uint32_t)(uint32_t *)txBuff->buffer, txBuff->length);
            }
#endif /* FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL */
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            /* Map loacl memory address to DMA for special platform. */
            buffer = (uint8_t *)MEMORY_ConvertMemoryMapAddress((uint32_t)txBuff->buffer, kMEMORY_Local2DMA);
#else
            buffer  = txBuff->buffer;
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */

            /* Set data buffer and length. */
            curBuffDescrip         = txBdRing->txBdBase + txBdRing->txGenIdx;
            curBuffDescrip->buffer = (uint8_t *)(uint32_t *)buffer;
            curBuffDescrip->length = txBuff->length;

            /* Increase txBuffer array address and the buffer descriptor address. */
            txBuff++;
            txBdRing->txGenIdx = ENET_IncreaseIndex(txBdRing->txGenIdx, txBdRing->txRingLen);

#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
            ENET_PrepareTxDesc(curBuffDescrip, &txFrame->txConfig);
#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */

            /* Linked buffers */
            if (--txBuffNum != 0U)
            {
                /* Set BD ready flag and clean last BD flag. */
                configVal = (uint32_t)curBuffDescrip->control;
                configVal &= ~ENET_BUFFDESCRIPTOR_TX_LAST_MASK;
                configVal |= ENET_BUFFDESCRIPTOR_TX_READY_MASK;
                curBuffDescrip->control = (uint16_t)configVal;

                primask = DisableGlobalIRQ();
                txBdRing->txDescUsed++;
                EnableGlobalIRQ(primask);
            }
            else
            {
                curBuffDescrip->control |= (ENET_BUFFDESCRIPTOR_TX_READY_MASK | ENET_BUFFDESCRIPTOR_TX_LAST_MASK);

                /* Add context to frame info ring */
                txDirty               = txDirtyRing->txDirtyBase + txDirtyRing->txGenIdx;
                txDirty->context      = txFrame->context;
                txDirtyRing->txGenIdx = ENET_IncreaseIndex(txDirtyRing->txGenIdx, txDirtyRing->txRingLen);
                if (txDirtyRing->txGenIdx == txDirtyRing->txConsumIdx)
                {
                    txDirtyRing->isFull = true;
                }
                primask = DisableGlobalIRQ();
                txBdRing->txDescUsed++;
                EnableGlobalIRQ(primask);
            }
            /* Active Tx BD everytime to speed up transfer */
            ENET_ActiveSendRing(base, ringId);
        } while (txBuffNum != 0U);
    }
    return result;
}

/*!
 * deprecated Do not use this function. It has been superseded by @ref ENET_StartTxFrame.
 */
status_t ENET_SendFrameZeroCopy(ENET_Type *base,
                                enet_handle_t *handle,
                                const uint8_t *data,
                                uint32_t length,
                                uint8_t ringId,
                                bool tsFlag,
                                void *context)
{
    assert(handle != NULL);
    assert(data != NULL);
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_QUEUE);

    volatile enet_tx_bd_struct_t *curBuffDescrip;
    enet_tx_bd_ring_t *txBdRing       = &handle->txBdRing[ringId];
    enet_tx_dirty_ring_t *txDirtyRing = &handle->txDirtyRing[ringId];
    enet_frame_info_t *txDirty        = NULL;
    uint32_t len                      = 0;
    uint32_t sizeleft                 = 0;
    status_t result                   = kStatus_Success;
    uint8_t *data_temp;
    uint32_t configVal;
    bool isReturn = false;
    uint32_t primask;

    /* Check the frame length. */
    if (length > ENET_FRAME_TX_LEN_LIMITATION(base))
    {
        result = kStatus_ENET_TxFrameOverLen;
    }
    else
    {
        /* Check if the transmit buffer is ready. */
        curBuffDescrip = txBdRing->txBdBase + txBdRing->txGenIdx;
        if (0U != (curBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_READY_MASK))
        {
            result = kStatus_ENET_TxFrameBusy;
        }
        /* Check txDirtyRing if need frameinfo in tx interrupt callback. */
        else if (handle->txReclaimEnable[ringId] && !ENET_TxDirtyRingAvailable(txDirtyRing))
        {
            result = kStatus_ENET_TxFrameBusy;
        }
        else
        {
            /* One transmit buffer is enough for one frame. */
            if (handle->txBuffSizeAlign[ringId] >= length)
            {
                /* Copy data to the buffer for uDMA transfer. */
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
                data = (uint8_t *)MEMORY_ConvertMemoryMapAddress((uint32_t)data, kMEMORY_Local2DMA);
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */
                curBuffDescrip->buffer = (uint8_t *)(uint32_t)data;
                /* Set data length. */
                curBuffDescrip->length = (uint16_t)length;
#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
                /* For enable the timestamp. */
                if (tsFlag)
                {
                    curBuffDescrip->controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_TIMESTAMP_MASK;
                }
                else
                {
                    curBuffDescrip->controlExtend1 &= (uint16_t)(~ENET_BUFFDESCRIPTOR_TX_TIMESTAMP_MASK);
                }

#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */
                curBuffDescrip->control |= (ENET_BUFFDESCRIPTOR_TX_READY_MASK | ENET_BUFFDESCRIPTOR_TX_LAST_MASK);

                /* Increase the buffer descriptor address. */
                txBdRing->txGenIdx = ENET_IncreaseIndex(txBdRing->txGenIdx, txBdRing->txRingLen);

                /* Add context to frame info ring */
                if (handle->txReclaimEnable[ringId])
                {
                    txDirty               = txDirtyRing->txDirtyBase + txDirtyRing->txGenIdx;
                    txDirty->context      = context;
                    txDirtyRing->txGenIdx = ENET_IncreaseIndex(txDirtyRing->txGenIdx, txDirtyRing->txRingLen);
                    if (txDirtyRing->txGenIdx == txDirtyRing->txConsumIdx)
                    {
                        txDirtyRing->isFull = true;
                    }
                    primask = DisableGlobalIRQ();
                    txBdRing->txDescUsed++;
                    EnableGlobalIRQ(primask);
                }

